# JPerKgDegreeC Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..JPerKgDegreeC Property
SymbolTypeId Class See Also
---
Symbol J/(kg·°C), indicating unit Joules per kilogram degree Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JPerKgDegreeC { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JPerKgDegreeC As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JPerKgDegreeC {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace